Tekla Open API Reference for Tekla Structures 2025
DimensionSetBase Properties
The DimensionSetBase type exposes the following members.
Properties
Name | Description
Attributes
 The dimension set attributes.
Hideable
 Accesses the information if this object is hidden or not or if it should be.
QueryReturnValue
 Status information about the latest database operation (select, insert, modify, delete).
 (Inherited from DatabaseObject.)
Top
See Also
Reference
DimensionSetBase Class
Tekla.Structures.Drawing Namespace